![alt text](https://leetcode.com/static/images/LeetCode_Sharing.png)

# Problem 1

1:**Problem Statement:** 

You have a MySQL database with a single table called `stadium` that logs the number of people visiting each day. The table consists of three columns: `id` (a unique identifier for each record), `visit_date` (the date of visit), and `no_of_people` (the number of people visited on a particular date). Your task is to write a SQL query to find all records for which there are 3 or more consecutive dates where the number of people exceeds 100.

2:**Tables:**

```
+----+------------+--------------+
| id | visit_date | no_of_people |
+----+------------+--------------+
|  1 | 2017-07-01 |           10 |
|  2 | 2017-07-02 |          109 |
|  3 | 2017-07-03 |          150 |
|  4 | 2017-07-04 |           99 |
|  5 | 2017-07-05 |          145 |
|  6 | 2017-07-06 |         1455 |
|  7 | 2017-07-07 |          199 |
|  8 | 2017-07-08 |          188 |
+----+------------+--------------+
```

3:**SQL Query:**

In [18]:
%%sql
with cte1 as
(
select
  *,
  case
    when no_of_people >100 then null else 1 
  end as result
from stadium
)
,
cte2 as
(
select
  *
from
(
select
  *,
  count(result) over(order by visit_date) as grp
from cte1
)a  
where result is null
)

select
  id, visit_date, no_of_people
from
(
select
  *,
  count(*) over(partition by grp) as cnt
from cte2
)a
where cnt>=3

 * mysql://root:***@127.0.0.1:3306/hundred
4 rows affected.

[(5, datetime.date(2017, 7, 5), 145),
 (6, datetime.date(2017, 7, 6), 1455),
 (7, datetime.date(2017, 7, 7), 199),
 (8, datetime.date(2017, 7, 8), 188)]

4:**Query Explanation:**

The given solution uses a sequence of common table expressions (CTEs) and window functions to solve the problem.

1. **cte1**: This CTE goes through each record in the `stadium` table. For rows where `no_of_people` is not greater than 100, it assigns a value of `1` to a new column `result`. For rows where `no_of_people` is greater than 100, it assigns a `null` value to `result`.

2. **cte2**: This CTE calculates a cumulative count of non-null `result` values up to the current row (ordered by `visit_date`). It uses this count to group the rows. Rows that are not preceded by a row with `no_of_people` less than or equal to 100 will be in the same group. It then filters out the rows where `result` is not null.

3. The main query: It applies another window function over the result of cte2, counting the number of rows in each group (`cnt`). It then filters out the groups with a count less than 3. These are the groups that do not have at least 3 consecutive dates with `no_of_people` exceeding 100. The remaining groups represent periods of 3 or more consecutive days where `no_of_people` exceeded 100 each day.

5:**Analysis Application**

Understanding the days with high footfall (visitors exceeding 100 people for 3 or more consecutive days) is vital for stadium management. It helps in the following ways:

1. **Resource Management:** Management can plan for additional resources on high footfall days. For example, additional food and beverages may need to be ordered, or more security staff may need to be deployed.
2. **Maintenance Schedule:** High footfall might mean more wear and tear. Hence, maintenance activities could be planned around these high footfall days to ensure a great experience for visitors.
3. **Marketing and Promotions:** If there is a pattern in these high footfall days, special promotions or events could be organized to attract even more visitors.

# Problem 2

1: **Problem Statement**

    The problem requires writing a SQL query to find the median salary for each company from the employee database. Median salary represents the middle value of all salaries for a particular company when they are arranged in order. It is an important measure that provides an understanding of the central tendency of salaries in a company.

2: **Tables**

    The database consists of the table `employee`:

    **Table: employee**
    
    | emp_id | company | salary |
    |--------|---------|--------|
    |   1    |    A    |  2341  |
    |   2    |    A    |  341   |
    |   3    |    A    |  15    |
    |   4    |    A    | 15314  |
    |   5    |    A    |  451   |
    |   6    |    A    |  513   |
    |   7    |    B    |  15    |
    |   8    |    B    |  13    |
    |   9    |    B    | 1154   |
    |   10   |    B    | 1345   |
    |   11   |    B    | 1221   |
    |   12   |    B    |  234   |
    |   13   |    C    | 2345   |
    |   14   |    C    | 2645   |
    |   15   |    C    | 2645   |
    |   16   |    C    | 2652   |
    |   17   |    C    |   65   |
    
  
  
3: **SQL Query**

In [24]:
%%sql

with cte1 as
(
select
  *,
  row_number() over(partition by company order by salary) as positions ,

  case
   when count(*) over(partition by company) %2 !=0 then cast((count(*) over(partition by company)+1)/2 as signed integer)
  end as odd_target_position,
  case
   when count(*) over(partition by company) %2 =0 then cast((count(*) over(partition by company)/2)as signed integer)
  end as even_target_position_1,
  case
   when count(*) over(partition by company) %2 =0 then cast((count(*) over(partition by company)/2)+1 as signed integer)
  end as even_target_position_2
from employee

)
,
cte2 as
(
select
  *
from cte1
where positions=odd_target_position or positions= even_target_position_1 or positions = even_target_position_2
 )
 
select
 company, round(avg(salary),2) as median_salary
from cte2
group by 1

 * mysql://root:***@127.0.0.1:3306/hundred
3 rows affected.

[('A', Decimal('482.00')), ('B', Decimal('694.00')), ('C', Decimal('2645.00'))]

4: **Query Explanation**

    The solution query uses Common Table Expressions (CTEs) to solve the problem. 

    The first CTE `cte1` computes row number partitioned by `company` and ordered by `salary`, this gives us the positions of each salary within each company. It also calculates the target positions to extract for median, this is dependent on whether the total number of salaries per company is odd or even.

    The second CTE `cte2` then filters out rows from `cte1` where the position is either of the target positions (for both odd and even number of salaries).

    This solution would then be followed by a final query that computes median from the results of `cte2`.

5: **Analysis Application**

    Analyzing the median salary for each company has real-world applications in several areas:

    - **Internal Benchmarking**: Companies can compare their median salaries against each other as part of competitive analysis. This can help them understand if they are under or over paying their employees.

    - **Salary Transparency**: For potential employees, it provides an idea about what salary they can expect from a company, aiding in their decision-making process.

    - **Economic Analysis**: Economists can use this data to analyze wage growth, wage disparity, and the overall health of the labor market.

    - **Policy Making**: Government bodies can use such data for policy-making, such as minimum wage laws, taxation, and welfare policies. 

    Hence, this query provides valuable insights into the salary structure of companies, which is beneficial for individuals, companies, and government bodies.

# Problem 3

**1: Problem Statement:**

The given problem is based on data manipulation and table structuring. We are given a table named "players_location" which has two columns: 'name' and 'city'. The name represents the name of a player and city represents the city in which the player lives. 

Our goal is to transform the table in such a way that every city becomes a column and under each city column, we have the names of the players living in that city. For each city column, the rows will contain the names of the players from that city.

**2: Tables:**

The original "players_location" table would look like this:

| Name   | City      |
|--------|-----------|
| Sachin | Mumbai    |
| Virat  | Delhi     |
| Rahul  | Bangalore |
| Rohit  | Mumbai    |
| Mayank | Bangalore |

what we want : 

|Bangalore|  Mumbai  |Delhi|
|--------|-----------|-------|
| Mayank | Rohit     | Virat |
| Rahul  | Sachin    | NULL  |


**3: SQL Query:**

In [23]:
 
%%sql


with cte1 as
(
select
  case  when city='Bangalore' then name  end as Bangalore,
  case  when city='Mumbai' then name  end as Mumbai,
  case  when city='Delhi' then name  end as Delhi
from players_location
)

,
cte_bangalore as
(
select
  *,row_number() over() as rn_bangalore
from 
(
select
  Bangalore from cte1 order by 1 
)a 
where Bangalore is not  null 
),

cte_Mumbai as
(
select
  *,row_number() over() as rn_mumbai
from 
(
select Mumbai from cte1 order by 1 
)a 
where Mumbai is not  null 
)
,
cte_Delhi as
(
select
  *,row_number() over() as rn_delhi
from 
(
select Delhi from cte1 order by 1 
)a 
where Delhi is not  null 
)

select 
  Bangalore,Mumbai,Delhi
from cte_bangalore left join cte_mumbai on rn_bangalore= rn_mumbai left join cte_delhi on rn_bangalore= rn_delhi

 * mysql://root:***@127.0.0.1:3306/hundred
2 rows affected.

[('Mayank', 'Rohit', 'Virat'), ('Rahul', 'Sachin', None)]

**4: Query Explanation:**

The provided solution uses common table expressions (CTEs) and window functions to achieve the desired transformation. 

The query can be broken down into several parts:

- The first CTE (cte1) selects players based on their city and creates a separate column for each city with the respective player's name in it.

- The following three CTEs (cte_bangalore, cte_Mumbai, cte_Delhi) create separate tables for each city and assign a row number to each player in the city. This is done using the ROW_NUMBER() window function.

- Finally, these three CTEs are joined together on their row numbers, effectively aligning players from different cities on the same row, creating a table that meets the required format.

**5: Analysis Application:**

This type of analysis, which involves transforming data from row-level values to column headers, is beneficial in many real-life situations. For example:

- Data Visualization: Data often needs to be in a specific format for it to be accurately represented in graphs or charts. 

- Data Analysis: Certain types of statistical analysis require data to be in a 'wide' format (i.e., each subject has a row and each measurement has a column). 

- Data Reporting: In certain scenarios, it is more readable and insightful to present data in this transformed manner, especially when dealing with categorical data.

In the given context, this can be useful for a sports organization that wants to quickly visualize or analyze their players' distribution across different cities. The transformed table makes it easier to compare the number of players in each city directly.

# Problem 4

1. **Problem Statement**

   The task is to retrieve the second most recent activity of each user from the 'UserActivity' table. For users who only have one activity recorded, that single activity should be retrieved. The 'UserActivity' table contains information about each user's activities and the respective start and end dates.

2. **Tables**

   The table that will be used is `UserActivity`. 

   `UserActivity`:
   
   | username | activity | startDate | endDate   |
   |----------|----------|-----------|-----------|
   | Alice    | Travel   | 2020-02-12| 2020-02-20|
   | Alice    | Dancing  | 2020-02-21| 2020-02-23|
   | Alice    | Travel   | 2020-02-24| 2020-02-28|
   | Bob      | Travel   | 2020-02-11| 2020-02-18|

3. **SQL Query**

In [27]:
%%sql

with cte1 as
(
select
  *,
  row_number() over (partition by username order by endDate desc) as rn,
  count(*) over(partition by username) as total_activities
from useractivity
)

select
  username,activity,startDate,endDate
from cte1
where (total_activities>1 and rn=2) or total_activities=1

 * mysql://root:***@127.0.0.1:3306/hundred
2 rows affected.

[('Alice', 'Dancing', datetime.date(2020, 2, 21), datetime.date(2020, 2, 23)),
 ('Bob', 'Travel', datetime.date(2020, 2, 11), datetime.date(2020, 2, 18))]

4. **Query Explanation**

   The query works in two stages. 

   In the first stage, a Common Table Expression (CTE) named 'cte1' is created. This CTE adds two new columns to the 'UserActivity' table: 'rn' (row number) and 'total_activities'. The 'rn' column ranks each user's activities based on the 'endDate' (with the most recent being 1), and the 'total_activities' column counts the number of activities each user has.

   In the second stage, a SELECT query is used to retrieve the rows from 'cte1' where 'rn' is 2 (the second most recent activity), but only for users who have more than one activity (as per 'total_activities'). If a user only has one activity ('total_activities' = 1), this activity is also selected.
   

5. **Analysis Application**

   This analysis can be beneficial in numerous real-life applications, such as:

   - In a fitness or health application, understanding a user's activities can provide insight into their routine, helping tailor recommendations or interventions.

   - In a productivity tool, identifying the most recent activities can help determine what tasks a user prioritizes or spends most of their time on.

   - In a social media platform, this information could be used to customize a user's news feed, promoting content related to their recent activities.

   - In customer relationship management (CRM), identifying recent activities could aid in understanding customer behavior, which could be used to enhance customer service or recommend products.
   
In all these applications, understanding not just the most recent activity but also the second most recent can provide a broader picture of the user's behavior or preferences, informing better decision-making.

# Problem 5

1. **Problem Statement**

   The task is to extract data from a database that logs user spending on an online shopping website which has a desktop and mobile application. The information needed includes the total number of users, the total amount spent on each platform (mobile, desktop, and both) for each date.

2. **Tables**

   The table that will be used is `spending`. 

   `spending`:
   
   | user_id | spend_date | platform | amount |
   |---------|------------|----------|--------|
   | 1       | 2019-07-01 | mobile   | 100    |
   | 1       | 2019-07-01 | desktop  | 100    |
   | 2       | 2019-07-01 | mobile   | 100    |
   | 2       | 2019-07-02 | mobile   | 100    |
   | 3       | 2019-07-01 | desktop  | 100    |
   | 3       | 2019-07-02 | desktop  | 100    |

3. **SQL Query**

In [28]:
%%sql

select
    spend_date , 
    count(*) as total_transactions, 
    count(distinct user_id) as distinct_transactions, 

    count(case
      when platform = "mobile" then 1 end )as mobile_transactions,
    count(case when platform = "desktop" then 1 end )as desktop_transactions,

    sum(case when platform = "mobile" then amount end )as mobile_spent,
    sum(case when platform = "desktop" then amount end) as desktop_spent,
    sum(amount) as total_spent

from spending
group by spend_date

 * mysql://root:***@127.0.0.1:3306/hundred
2 rows affected.

[(datetime.date(2019, 7, 1), 4, 3, 2, 2, Decimal('200'), Decimal('200'), Decimal('400')),
 (datetime.date(2019, 7, 2), 2, 2, 1, 1, Decimal('100'), Decimal('100'), Decimal('200'))]

4. **Query Explanation**

   This query aggregates data from the 'spending' table by 'spend_date'. For each date, it calculates:

   - 'total_transactions': the total number of transactions.
   - 'distinct_transactions': the total number of unique users who made a transaction.
   - 'mobile_transactions': the total number of transactions made via the mobile platform.
   - 'desktop_transactions': the total number of transactions made via the desktop platform.
   - 'mobile_spent': the total amount spent via the mobile platform.
   - 'desktop_spent': the total amount spent via the desktop platform.
   - 'total_spent': the total amount spent across both platforms.

   The use of the CASE statement allows the query to differentiate between transactions made on the mobile platform and the desktop platform.

5. **Analysis Application**

   This analysis can be very beneficial for e-commerce and online retail companies. It helps to track user spending behavior based on the platform they use for purchases. This can provide valuable insights, such as:

   - Understanding which platform (mobile or desktop) generates more revenue on a daily basis. This can guide decisions on where to focus development and marketing resources.
   
   - Understanding daily sales trends and patterns, which can aid in inventory and sales forecasting.
   
   - The distinct user count allows the company to track active users on each day, which can be helpful in evaluating user engagement and retention strategies.
   
   - Evaluating the effectiveness of platform-specific promotions or features, as changes in these metrics before and after implementation can indicate their success.
   
   - Identifying any anomalies in the transactions (for example, a sudden decrease in transactions on a platform could indicate a technical issue).